### Import the necessary libraries

In [17]:
import pandas as pd
import sqlalchemy as alch
from getpass import getpass

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [18]:

password = getpass("Introduce tu pass de sql: ")

Introduce tu pass de sql: ········

### Establishes the connection to the database

In [19]:
dbName="publications"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"

### Remember to create the engine

In [20]:
engine = alch.create_engine(connectionData)
print("Connected to server!")

Connected to server!

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [21]:
df = pd.read_sql_query("""
SELECT 
authors.au_id as "AUTOR ID",
authors.au_lname as "LAST NAME",
authors.au_fname as "FIRST NAME",
titles.title as "TITLE",
publishers.pub_name as "PUBLISHER"

FROM 
authors 
INNER JOIN titleauthor
ON titleauthor.au_id = authors.au_id
INNER JOIN titles 
ON titles.title_id= titleauthor.title_id
INNER JOIN publishers 
ON titles.pub_id= publishers.pub_id;""", engine
)

In [22]:
df.head()

,AUTOR ID,LAST NAME,FIRST NAME,TITLE,PUBLISHER
0,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [23]:
df = pd.read_sql_query("""
SELECT  
authors.au_id as 'AUTOR ID',
authors.au_lname as 'LAST NAME',
authors.au_fname as 'FIRST NAME',

publishers.pub_name as 'PUBLISHER',
COUNT(titles.title_id) AS 'TITLE COUNT'

FROM 
authors 
INNER JOIN titleauthor
ON titleauthor.au_id = authors.au_id
INNER JOIN titles 
ON titles.title_id= titleauthor.title_id
INNER JOIN publishers 
ON titles.pub_id= publishers.pub_id
GROUP BY publishers.pub_id, authors.au_id""", engine
)

In [24]:
df.head()

      AUTOR ID LAST NAME FIRST NAME       PUBLISHER  TITLE COUNT
0  213-46-8915     Green   Marjorie  New Moon Books            1
1  899-46-2035    Ringer       Anne  New Moon Books            1
2  998-72-3567    Ringer     Albert  New Moon Books            2
3  172-32-1176     White    Johnson  New Moon Books            1
4  486-29-1786  Locksley   Charlene  New Moon Books            1

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [25]:
df = pd.read_sql_query("""
SELECT  
authors.au_id as 'AUTOR ID',
authors.au_lname as 'LAST NAME',
authors.au_fname as 'FIRST NAME',
SUM(sales.qty) AS 'TITLE COUNT'

FROM 
authors 
INNER JOIN titleauthor
ON titleauthor.au_id = authors.au_id
INNER JOIN titles 
ON titles.title_id= titleauthor.title_id
INNER JOIN sales 
ON sales.title_id=titles.title_id
GROUP BY authors.au_id,authors.au_lname,authors.au_fname
ORDER BY 'TITLE COUNT' DESC
LIMIT 3;""", engine
)

In [26]:
df.head()

      AUTOR ID LAST NAME FIRST NAME  TITLE COUNT
0  213-46-8915     Green   Marjorie         50.0
1  409-56-7008    Bennet    Abraham         15.0
2  899-46-2035    Ringer       Anne        148.0

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [36]:
df = pd.read_sql_query(
"""
SELECT  
authors.au_id as 'AUTOR ID',
authors.au_lname as 'LAST NAME',
authors.au_fname as 'FIRST NAME',
IFNULL(SUM(sales.qty), 0) AS 'TITLE_COUNT'

FROM 
authors 
LEFT JOIN titleauthor
ON titleauthor.au_id = authors.au_id
LEFT JOIN titles 
ON titles.title_id= titleauthor.title_id
LEFT JOIN sales 
ON sales.title_id=titles.title_id
GROUP BY authors.au_id,authors.au_lname,authors.au_fname
ORDER BY TITLE_COUNT DESC
LIMIT 23;

"""
,engine
)

In [ ]:
df.head()

## Bonus Challenge - Most Profiting Authors